package com.anastasiaiva.pelmenisegodnya.repository

import android.content.SharedPreferences
import androidx.core.content.edit

class KerilRepository (private val preferences: SharedPreferences) {
    private val phrases = listOf(
        "Псина сутулая 😐",
        "Подзалупный творожок 🔥",
        "Говёшка на ладошке 💩",
        "Чепушила очёрская \uD83D\uDE0F",
        "Петушара вшивая \uD83D\uDC14",
        "Гнидыч лохматый \uD83E\uDEE1",
        "Сопля сухая \uD83E\uDD0C",
        "Микропенис \uD83E\uDD0F",
        "Иуда чумная \uD83E\uDD73",
        "Черт косматый \uD83E\uDD28",
        "Лисичка трусовая",
        "Дадрик волосатый",
        "Конина жЁваная",
        "Писькина папиллома",
        "Филипп Киркоров!",
        "Лариса Долина без хаты",
        "Вонючая бабкина пятка",
        "Мамина радость, папина сладость",
        "Мамин бродяга, папин симпатяга",
        "Гордость всех городских бомжей",
        "Коровья лепёшка",
        "Висячая бабкина сиська",
        "Ферерро роше в сочи в лаваше"
    )

    val endingPhrases = listOf(
        "С каждым может случиться...",
        "Ну ничего страшного. Тяу-тяу-тяу-тяу",
        "Тут даже и добавить нечего!",
        "Я всегда подозревал в тебе что-то такое...",
        "Не, ну по факту!",
        "Не переживай, в следующий раз будешь кем-то другим",
        "Надеюсь, ты в восхищении!",
        "По-моему похожо",
        "Ничего удивительного, знаешь ли...",
        "Ну штош...",
        "В этот раз как-то получше, да?..",
        "Ну шо, нраица?))",
        "Я в восхищении!",
        "Это апогей моего креатива...",
        "Так се, конечно...",
        "Раз не вышло, так чего уж!",
        "Главное, что не мамочка двух ангелочков!"
    )

    private companion object {
        private const val KEY_LAST_RESULT_TIMESTAMP = "last_result_timestamp"
    }


    fun getRandomPhrase(): String {
        return phrases.random()
    }

    fun getRandomEndingPhrase(): String {
        return endingPhrases.random()
    }

fun saveLastTimestamp(timestamp: Long) {
    preferences.edit {
        putLong(KEY_LAST_RESULT_TIMESTAMP, timestamp)
    }
}

    fun getLastTimestamp(): Long? {
        return if (preferences.contains(KEY_LAST_RESULT_TIMESTAMP)) {
            preferences.getLong(KEY_LAST_RESULT_TIMESTAMP, 0L)
        } else {
            null
        }
    }
}
